import numpy as np
data = np.array([
    0.839, 1.065, 0.922, 0.916, 0.611, 1.041, 0.857, 1.375, 1.383, 1.381,
    0.853, 1.086, 0.786, 1.215, 1.147, 0.871, 1.203, 0.858, 1.126, 1.190,
    0.613, 1.406, 0.953, 0.700, 0.844, 0.896, 0.816, 1.089, 0.944, 0.962,
    1.137, 1.088, 1.284, 1.184, 0.967, 1.061, 0.872, 1.323, 0.949, 0.906,
    0.841, 0.708, 0.753, 0.888, 1.149, 1.202, 1.033, 1.034, 0.667, 1.102
])

c = 0.88
d = 1.08

n = data.size

E = np.mean(data)

D = np.mean((data - E)**2)

SKO = np.sqrt(D)

median = np.median(data)

m3 = np.mean((data - E)**3)
assim = m3 / (SKO**3)

m4 = np.mean((data - E)**4)
excess = m4 / (D**2) - 3

count = np.sum((data >= c) & (data <= d))
P = count / n

total_sum = np.sum(data)
print("Сумма всех значений:", total_sum)
print("Выборочные числовые характеристики:")
print(f"(a) Математическое ожидание:            {E:.4f}")
print(f"(b) Дисперсия:        {D:.4f}")
print(f"(c) СКО:       {SKO:.4f}")
print(f"(d) Медиана:                            {median:.4f}")
print(f"(e) Коэффициент асимметрии:             {assim:.4f}")
print(f"(f) Коэффициент эксцесса (избыточност): {excess:.4f}")
print(f"(g) P(X ∈ [{c:.2f}, {d:.2f}]):          {P:.4f}  (число точек в интервале = {count}/{n})")
