import numpy as np
from scipy.stats import norm

x = np.array([
    0.839, 1.065, 0.922, 0.916, 0.611, 1.041, 0.857, 1.375, 1.383, 1.381,
    0.853, 1.086, 0.786, 1.215, 1.147, 0.871, 1.203, 0.858, 1.126, 1.190,
    0.613, 1.406, 0.953, 0.700, 0.844, 0.896, 0.816, 1.089, 0.944, 0.962,
    1.137, 1.088, 1.284, 1.184, 0.967, 1.061, 0.872, 1.323, 0.949, 0.906,
    0.841, 0.708, 0.753, 0.888, 1.149, 1.202, 1.033, 1.034, 0.667, 1.102])
n = len(x)
a0 = 0.95
a1 = 1.05
s0 = 0.20
s1 = 0.20
z = norm.ppf(0.99)
xm = np.mean(x)

k = a0 + s0 / n**0.5 * z
b = 1 - norm.cdf((k - a1) / (s1 / n**0.5))

k2 = a1 - s0 / n**0.5 * z
b2 = norm.cdf((k2 - a0) / (s0 / n**0.5))

print(f"n = {n}")
print(f"x̄ = {xm:.5f}")
print(f"Критическая граница k = {k:.5f}")
if xm > k:
    print("Решение: отвергаем H0")
else:
    print("Решение: не отвергаем H0")
print(f"Мощность критерия = {b:.5f}")

print(f"Новая граница k' = {k2:.5f}")
if xm < k2:
    print("Решение после обмена гипотез: отвергаем H0'")
else:
    print("Решение после обмена гипотез: не отвергаем H0'")
print(f"Мощность после обмена = {b2:.5f}")
